**Reading data of different formats**

In [1]:
import pandas as pd
import os
import numpy as np

In [2]:
s=pd.read_csv("learn/student.csv",index_col=0,na_values=["Three",55])
se=pd.read_excel("learn/student.xlsx")

In [3]:
s.head()

          name class  mark  gender
id
1     John Deo  Four  75.0  female
2     Max Ruin   NaN  85.0    male
3       Arnold   NaN   NaN    male
4   Krish Star  Four  60.0  female
5    John Mike  Four  60.0  female

In [4]:
se.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

**Data Frame**

In [5]:
cars_data=pd.read_csv("learn/Toyota.csv",index_col=0)

In [6]:
cars_data.head()

   Price   Age     KM FuelType  HP  MetColor  Automatic    CC  Doors  Weight
0  13500  23.0  46986   Diesel  90       1.0          0  2000  three    1165
1  13750  23.0  72937   Diesel  90       1.0          0  2000      3    1165
2  13950  24.0  41711   Diesel  90       NaN          0  2000      3    1165
3  14950  26.0  48000   Diesel  90       0.0          0  2000      3    1165
4  13750  30.0  38500   Diesel  90       0.0          0  2000      3    1170

In [7]:
#copying of dataframe
cars=cars_data.copy(deep=True)

In [8]:
cars.index

Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
       ...
       1426, 1427, 1428, 1429, 1430, 1431, 1432, 1433, 1434, 1435],
      dtype='int64', length=1436)

In [9]:
cars.columns

Index(['Price', 'Age', 'KM', 'FuelType', 'HP', 'MetColor', 'Automatic', 'CC',
       'Doors', 'Weight'],
      dtype='object')

In [10]:
cars.size

14360

In [11]:
cars.shape

(1436, 10)

In [12]:
cars.memory_usage()

Index        11488
Price        11488
Age          11488
KM           11488
FuelType     11488
HP           11488
MetColor     11488
Automatic    11488
CC           11488
Doors        11488
Weight       11488
dtype: int64

In [13]:
cars.ndim

2

In [14]:
cars.at[2,"Age"]

np.float64(24.0)

In [15]:
cars.loc[:,'FuelType']

0       Diesel
1       Diesel
2       Diesel
3       Diesel
4       Diesel
         ...
1431    Petrol
1432    Petrol
1433    Petrol
1434       NaN
1435    Petrol
Name: FuelType, Length: 1436, dtype: object